app/views/articles/_form.html.erb

SELECT "authors".* FROM "authors"
---
    <%= f.label :author %> <br>
    <%= collection_select(:article, :author_id, Author.all, :id, :last_name, prompt: true) %>

SELECT "tags".* FROM "tags"
---
    <%= f.label :tag, "Tags" %> <br>
    <%= collection_check_boxes(:article, :tag_ids, Tag.all, :id, :name, prompt: true) %>