app/views/articles/show.html.erb

<ul>
  <% @article.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "article_tags" ON "tags"."id" = "article_tags"."tag_id" WHERE "article_tags"."article_id" = ?  [["article_id", 10]]