app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Another Article"], ["body", "This article is really the best"], ["author_id", 1], ["created_at", "2016-03-23 03:23:39.060501"], ["updated_at", "2016-03-23 03:23:39.060501"]]