app/controllers/authors_controller.rb

INSERT INTO "authors" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Christian"], ["last_name", "Baker"], ["created_at", "2016-03-23 03:21:31.056298"], ["updated_at", "2016-03-23 03:21:31.056298"]]
---
  def create
    @author = Author.new(author_params)

    if @author.save

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "authors" SET "last_name" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["last_name", "Duder"], ["updated_at", "2016-03-23 03:34:58.483892"], ["id", 2]]
---
  def update
    @author = Author.find(params[:id])

    if @author.update(author_params)