app/controllers/tags_controller.rb

  def create
    @tag = Tag.new(tag_params)

    if @tag.save
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Helpful"], ["created_at", "2016-03-23 03:22:24.113160"], ["updated_at", "2016-03-23 03:22:24.113160"]]